/*===============================================================
 *   文件名称：di1.c
 *   创 建 者：ruby
 *   创建日期：2017年11月12日
 ================================================================*/

#include <stdio.h>

int main()
{
	int i,j;
	/**********测试两个for******************/
	for(i=0;i<10;i++)
	{
		for(j=0;j<10;j++)
		{
			if(j == 5)
				break;
			printf("j = %d ",j);		
		}
		if(i == 5)
			break;
		printf("\n");
	} 		//这两个for循环是如何执行的

	/********测试while + for***********/	
	j =10;
	while(j--)
	{
		for(i=0;i<10;i++)
		{
			if(i==5)
				break;
		}
		if(j==5)
			break;
	}                             //自己加打印语句看是如何循环的
	return 0;
}
